#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


// 3차원 배열의 선언
// 자료형 배열이름 [크기1][크기2][크기3]
// 1 : 면의 개수
// 2 : 행의 개수
// 3 : 열의 개수
// 1번이 가장 큰 덩어리 3번이 가장 작은 덩어리
// int i[2][3][4]
// i[][][] 형태만 값이고 나머지는 전부 주소
 
// 다차원 배열의 초기화(2차원 이상) - 모호성 X, 결정할 수 없음 X
// 초기값의 지정형태는 다차원 배열이 배열의 배열이라는 것을 생각하여 초기값을 구분하여 지정하거나,
// 1차원 배열처럼 초기값 리스트를 지정하여 순서대로 배열 요소의 초기값으로 설정.
// 중괄호는 배열의 차원과 레벨이 맞아야만 한다.
// int i[2][3] = {{1,2,3},{4,5,6}};  -- 가장 좋은 형태
// int i[2][3] = {1,2,3,4,5,6};
// int i[][3] = {{1,2,3},{4,5,6}};  -- 좋지 않다. 명확한 것이 좋다  / int i[2][] = {{1,2,3},{4,5,6}};  -- 이건 불가능하다
#if 0
int main() {
	// int a[2][] = { {1,2,3},{4,5,6} };
	int a[2][3][4] = { [0] [1] [2] = 3,[1][1][1] = 7 };
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			for (int l = 0; l < 4; l++) {
				printf("%d ", a[i][j][l]);
			}
		}
	}
	return 0;
}
#endif

// 3차원 배열의 초기화
// int i[2][3][4] = {	{1,2,3,4},
//						{5,6,7,8},
//						{9,10,11,12},
//						...
// C99 이후 표준에서, 배열의 초기화는
// int i[2][3][4] = { [0][1][2] = 3, [1][1][1] = 7		}; -> 이와 같이 가능하다
// 1치원 배열과 2차원 배열에서도 같은 방법으로 쓸 수 있다. 나머지는 0
// 
// 3차원 배열은 데이터에 접근 방향 주의!
// 접근 순서가 매우 중요하다!
// 컴퓨터가 i[0][0][0]을 읽을때 효율을 위해 다음 것들까지 함께 읽음 --> 캐쉬 cash?
// 따라서 접근할때 순서가 중요 -- i,j,k 순서와 k,j,i 순서가 크기는 똑같다고 볼 수도 있지만 내부에서는 다르다
// 
// 문자 다차원 배열
// char c[3][20] = 
//					{ "fsaf",
//					  "ahfdh",
//					  "ewtgrdb"
//					};
// 역시나 1차원으로 쭉 이어짐
// ""로 만들면 그 속의 내용이 Text 영역에 따로 저장
// 이후엔 Text 영역에서 복사되어 온다
// gets와 %s는 문자열의 시작 주소를 주어야함  <--> %c는 하나의 값을 주어야함
// int i[2][3][4] = {	{1,2,3,4},
//						{5,6,7,8},
//						{9,10,11,12},
//						{13,14,15,16},
//						{17,18,19,20},
//						{21,22,23,24}
//					};					// 잘못된 방법 직접 해보기
// 
// 3차원 int 배열의 주소와 주소의 표현
// int i[2][3][4] = {100,200,300,400,500,};  -> 2덩어리 -> 각 3덩어리 -> 각 4덩어리
//

#if 0
int main() {
	int i[2][3][4] = { 100,200,300,400,500, };

	printf("i = %p\n", i);						// 0
	printf("i+1 = %p\n\n", i + 1);				// 48

	printf("&i = %p\n", &i);					// 0
	printf("&i+1 = %p\n\n", &i + 1);			// 96

	printf("i[0] = %p\n", i[0]);				// 0
	printf("i[1] = %p\n", i[1]);				// 48
	printf("i[2] = %p\n\n", i[2]);				// 96

	printf("i[0]+1 = %p\n", i[0] + 1);			// 16
	printf("i[1]+1 = %p\n\n", i[1] + 1);		// 64

	printf("&i[0] = %p\n", &i[0]);				// 0
	printf("&i[1] = %p\n\n", &i[1]);			// 48

	printf("&i[0]+1 = %p\n", &i[0] + 1);		// 48
	printf("&i[1]+1 = %p\n\n", &i[1] + 1);		// 96

	printf("&i[0][0] = %p\n", &i[0][0]);		// 0
	printf("&i[1][0] = %p\n\n", &i[1][0]);		// 48

	printf("&i[0][0]+1 = %p\n", &i[0][0] + 1);  // 16
	printf("&i[1][0]+1 = %p\n\n", &i[1][0] + 1);// 64

	printf("%d", i[0][0][0]);					// 100

	// 날잡고 한번 4차원 배열 만들어보기..
	return 0;
}
#endif

// 3차원 배열에서 모든 주소는 상수이다
// int i[][][] 의 정의에서는, [][][] 형태인 것만 int 값이고,
// 즉, i, i[0], i[1][0] 등은 모두 주소이다.
// 모든 주소의 의미를 알아야, +1의 값을 계산할 수 있다.
// 
// 임베디드 프로그램은 내가 원하는 주소에 원하는 값을 넣을 수 있다.
//


// 2차원 배열의 1~20 4x5 배열에서 한줄씩 추가하여 행의 합과 열의 합을 적기
// 단순히 for문 두번 돌리는 것 가능
// for문을 한번만에 해보자
// 1 2 3 4 5 를 읽을 때 미리 마지막 행에 1 2 3 4 5를 더하자
// 
// 1  2  3  4  5	15
// 6  7  8  9  10	0
// 11 12 13 14 15	0
// 16 17 18 19 20	0
// 1  2  3  4  5	0
// 직접 해보기
#if 0
int main() {
	int a[5][6] = {
		{1,2,3,4,5,0},
		{6,7,8,9,10,0},
		{11,12,13,14,15,0},
		{16,17,18,19,20,0},
		{0,0,0,0,0,0}
	};
	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 6; j++) {
			if (j != 5) a[i][5] += a[i][j];
			a[4][j] += a[i][j];
		}
	}

	for (int i = 0; i < 5; i++) {
		for (int j = 0; j < 6; j++) {
			printf("%2d ", a[i][j]);
		}
		printf("\n");
	}
	return 0;
}
#endif

// 알파벳 소문자로 이루어진 문자열을 입력받아 각 문자들의 빈도수를 구하고, 그것을 출력하는 프로그램
// 입력: 문자열(소문자로만 입력)
// 출력: 각 소문자들의 빈도수. (a~z)까지의 빈도수
//
#if 0
int main() {
	int cnt[26] = { 0, }, len;
	char str[50];
	scanf("%s", str);
	len = strlen(str);
	for (int i = 0; i <= len; i++) {
		cnt[str[i] - 'a']++;
	}

	for (int i = 0; i < 26; i++) {
		printf("%c : %d\n", i + 'a', cnt[i]);
	}
	return 0;
}
#endif



// 20바이트 모세의 기적
#if 0
int main() {
	unsigned char arr[20];
	int num;
	for (int i = 0; i < 20; i++) {
		scanf("%hhu", &arr[i]);
	}
	scanf("%d", &num);
	for (int i = 0; i < 20; i++) {
		printf("%3d ", arr[i]);
	}
	printf("\n");

	for (int i = 0; i < num; i++) {
		for (int j = 0; j < 9; j++) {
			arr[j] = (arr[j] << 1) | (arr[j + 1] >> 7);
		}
		for (int j = 19; j > 10; j--) {
			arr[j] = (arr[j] >> 1) | (arr[j - 1] << 7);
		}
		arr[9] <<= 1;
		arr[10] >>= 1;
	}
	for (int i = 0; i < 20; i++) {
		printf("%3d ", arr[i]);
	}
	return 0;
}
#endif

// 3차원 1차원으로
#if 0
int main() {
	int n, m, v, x, y, z;
	scanf("%d %d %d %d %d %d", &n, &m, &v, &x, &y, &z);
	printf("%d", (m * v) * z + m * y + x);
	return 0;
}
#endif

// 1차원 3차원으로
#if 0
int main() {
	int n, m, v, k;
	scanf("%d %d %d %d", &n, &m, &v, &k);
	printf("%d %d %d", k / (m * v), (k % (m * v)) / v, (k % (m * v)) % v);
	return 0;
}
#endif

// 두부게임
#if 0
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main() {
	int n, arr[50], a, num;
	scanf("%d %d", &n, &num);
	for (int i = 0; i < num; i++) scanf("%d", &arr[i]);
	scanf("%d", &a);
	a--;
	for (int i = 0; i < num; i++) {
		if (a + arr[i] - 3 < 0) {
			a += arr[i] - 3 + n;
		}
		else {
			a += (arr[i] - 3) % 5;
		}
	}
	printf("%d", (a + 1) % n);
	return 0;
}
#endif

